app/controllers/diaries_controller.rb

SELECT "diaries".* FROM "diaries"
---
  def index
    @diaries = Diary.all

SELECT "diaries".* FROM "diaries" WHERE "diaries"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @diary = Diary.find(params[:id])